astb_relise/src/Documents/ПродлениеСрокаЭксплуатации/ПродлениеСрокаЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродлениеСрокаЭксплуатации</name>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредседателя</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии1</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность1</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии2</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность2</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии3</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность3</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзносаПоУчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПотребностиПоУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПотребности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоУчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзносаПоРегистру</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗимы</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
    <attributes>
      <name>КонецЗимы</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/ВыдачаПоПотребности/ВыдачаПоПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаПоПотребности</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/AccumulationRegisters/ВыданныеСредстваЗащиты/ВыданныеСредстваЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыданныеСредстваЗащиты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеВыводитьВыдачуВ_ЛК</name>
    <comment>АСТБ_Горюшин_Алексей_19561</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/AccumulationRegisters/ПотребностьВыдачиСИЗ/ПотребностьВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностьВыдачиСИЗ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентИзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/Documents/ПродлениеСрокаЭксплуатации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродлениеСрокаЭксплуатацииТовары.НормаВыдачи КАК НормаВыдачи,
	|	ПродлениеСрокаЭксплуатацииТовары.НоменклатураНормы КАК НоменклатураНормы,
	|	ПродлениеСрокаЭксплуатацииТовары.ДатаВыдачи КАК ДатаВыдачи,
	|	ПродлениеСрокаЭксплуатацииТовары.ДатаПотребностиПоУчету КАК ДатаПотребностиПоУчету,
	|	ПродлениеСрокаЭксплуатацииТовары.ПроцентИзноса КАК ПроцентИзноса,
	|	ПродлениеСрокаЭксплуатацииТовары.ДатаПотребности КАК ДатаПотребности,
	|	ПродлениеСрокаЭксплуатацииТовары.КоличествоПоУчету КАК КоличествоПоУчету,
	|	ПродлениеСрокаЭксплуатацииТовары.Количество КАК Количество,
	|	ПродлениеСрокаЭксплуатацииТовары.ПроцентИзносаПоРегистру КАК ПроцентИзносаПоРегистру,
	|	ПродлениеСрокаЭксплуатацииТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.ПродлениеСрокаЭксплуатации.Товары КАК ПродлениеСрокаЭксплуатацииТовары
	|ГДЕ
	|	ПродлениеСрокаЭксплуатацииТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ТаблицаДокумента.Ссылка.Организация КАК Организация,
	|	ВТ_ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.ДатаПотребностиПоУчету КАК ДатаПотребности,
	|	ВТ_ТаблицаДокумента.ПроцентИзносаПоРегистру КАК ПроцентИзноса,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребности_Движения
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_ТаблицаДокумента.Ссылка.Организация,
	|	ВТ_ТаблицаДокумента.Ссылка.Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи,
	|	ВТ_ТаблицаДокумента.ДатаПотребности,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса.Код,
	|	ВТ_ТаблицаДокумента.Количество
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ТаблицаДокумента.Ссылка.Организация КАК Организация,
	|	ВТ_ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаПотребностиПоУчету КАК ДатаПотребности,
	|	ВТ_ТаблицаДокумента.ПроцентИзносаПоРегистру КАК ПроцентИзноса,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Потребность_Движения
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_ТаблицаДокумента.Ссылка.Организация,
	|	ВТ_ТаблицаДокумента.Ссылка.Сотрудник,
	|	ВТ_ТаблицаДокумента.НормаВыдачи,
	|	ВТ_ТаблицаДокумента.НоменклатураНормы,
	|	ВТ_ТаблицаДокумента.ДатаПотребности,
	|	ВТ_ТаблицаДокумента.ПроцентИзноса.Код,
	|	ВТ_ТаблицаДокумента.Количество
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаПоПотребности_Движения.Период КАК Период,
	|	ВТ_ВыдачаПоПотребности_Движения.ВидДвижения КАК ВидДвижения,
	|	ВТ_ВыдачаПоПотребности_Движения.Организация КАК Организация,
	|	ВТ_ВыдачаПоПотребности_Движения.Сотрудник КАК Сотрудник,
	|	ВТ_ВыдачаПоПотребности_Движения.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ВыдачаПоПотребности_Движения.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ВыдачаПоПотребности_Движения.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ВыдачаПоПотребности_Движения.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_ВыдачаПоПотребности_Движения.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_ВыдачаПоПотребности_Движения.Количество КАК Количество
	|ИЗ
	|	ВТ_ВыдачаПоПотребности_Движения КАК ВТ_ВыдачаПоПотребности_Движения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ВыдачаПоПотребности_Движения.НормаВыдачи.Наименование,
	|	ВТ_ВыдачаПоПотребности_Движения.НоменклатураНормы.Наименование,
	|	ВТ_ВыдачаПоПотребности_Движения.ДатаВыдачи,
	|	ВТ_ВыдачаПоПотребности_Движения.ВидДвижения УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потребность_Движения.Период КАК Период,
	|	ВТ_Потребность_Движения.ВидДвижения КАК ВидДвижения,
	|	ВТ_Потребность_Движения.Организация КАК Организация,
	|	ВТ_Потребность_Движения.Сотрудник КАК Сотрудник,
	|	ВТ_Потребность_Движения.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_Потребность_Движения.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_Потребность_Движения.ДатаПотребности КАК ДатаПотребности,
	|	ВТ_Потребность_Движения.ПроцентИзноса КАК ПроцентИзноса,
	|	ВТ_Потребность_Движения.Количество КАК Количество
	|ИЗ
	|	ВТ_Потребность_Движения КАК ВТ_Потребность_Движения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Потребность_Движения.НормаВыдачи.Наименование,
	|	ВТ_Потребность_Движения.НоменклатураНормы.Наименование,
	|	ВТ_Потребность_Движения.ДатаПотребности,
	|	ВТ_Потребность_Движения.ВидДвижения УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	//по регистру "ПотребностьВыдачиСИЗ"
	ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВыдачиСИЗ", Результат[4].Выгрузить());
	
	//по регистру "ВыдачаПоПотребности"
	ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", Результат[3].Выгрузить());
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"Акт",
			"Акт",
			СформироватьПечатнуюФормуАкта(МассивОбъектов, ОбъектыПечати),,"Документ.ПродлениеСрокаЭксплуатации.ПФ_MXL_АКТ");
				
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть(ТекущийОбъект) Экспорт	
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(ТекущийОбъект.Сотрудник);
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,ТекущийОбъект.Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(ТекущийОбъект.Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм,ТекущийОбъект.Организация,ДатаАнализа);
	ТаблицаЗимы                 = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуНачалаИКонцаЗимы(ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТекущийОбъект.Организация,ДатаАнализа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗимы.НачалоЗимы КАК НачалоЗимы,
	|	ТаблицаЗимы.КонецЗимы КАК КонецЗимы,
	|	ТаблицаЗимы.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_ТаблицаЗимы
	|ИЗ
	|	&ТаблицаЗимы КАК ТаблицаЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеНормы.Подразделение КАК Подразделение,
	|	ПодобранныеНормы.ЭтоЗима КАК ЭтоЗима,
	|	ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_ПодобранныеНормы
	|ИЗ
	|	&ПодобранныеНормы КАК ПодобранныеНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ПодобранныеНормы.ЭтоЗима) КАК ЭтоЗима,
	|	ВТ_ПодобранныеНормы.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаЗимы.НачалоЗимы КАК НачалоЗимы,
	|	ВТ_ТаблицаЗимы.КонецЗимы КАК КонецЗимы
	|ПОМЕСТИТЬ ВТ_ЗимаПоНормамВыдачи
	|ИЗ
	|	ВТ_ПодобранныеНормы КАК ВТ_ПодобранныеНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗимы КАК ВТ_ТаблицаЗимы
	|		ПО ВТ_ПодобранныеНормы.Подразделение = ВТ_ТаблицаЗимы.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПодобранныеНормы.НормаВыдачи,
	|	ВТ_ПодобранныеНормы.НоменклатураНормы,
	|	ВТ_ТаблицаЗимы.НачалоЗимы,
	|	ВТ_ТаблицаЗимы.КонецЗимы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОбороты.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОбороты.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОбороты.ДатаПотребности КАК ДатаПотребности,
	|	ВыдачаПоПотребностиОбороты.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОбороты.ПроцентИзноса КАК ПроцентИзноса,
	|	МАКСИМУМ(ВыдачаПоПотребностиОбороты.Период) КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_ПоследнийПриходВыдачиПоПотребности
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Обороты(, &Период, Регистратор, Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОбороты
	|ГДЕ
	|	НЕ ВыдачаПоПотребностиОбороты.КоличествоПриход = 0
	|	И НЕ ВыдачаПоПотребностиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОбороты.НормаВыдачи,
	|	ВыдачаПоПотребностиОбороты.НоменклатураНормы,
	|	ВыдачаПоПотребностиОбороты.ДатаПотребности,
	|	ВыдачаПоПотребностиОбороты.ДатаВыдачи,
	|	ВыдачаПоПотребностиОбороты.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса КАК ПроцентИзносаПоРегистру,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности КАК ДатаПотребностиПоУчету,
	|	ВыдачаПоПотребностиОстатки.КоличествоОстаток КАК КоличествоПоУчету,
	|	МАКСИМУМ(ВыдачаПоПотребностиОстатки.КоличествоОстаток) КАК Количество,
	|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
	|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА &ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
	|					ТОГДА РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, ДЕНЬ)
	|				ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, МЕСЯЦ)
	|			КОНЕЦ >= 1
	|			ТОГДА 100
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаПоПотребностиОстатки.ПроцентИзноса = 0
	|					ТОГДА ВЫБОР
	|							КОГДА &ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
	|								ТОГДА РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, ДЕНЬ)
	|							ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, МЕСЯЦ)
	|						КОНЕЦ * 100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
	|							ТОГДА РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, ДЕНЬ)
	|						ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, МЕСЯЦ)
	|					КОНЕЦ * (1 - ВыдачаПоПотребностиОстатки.ПроцентИзноса / 100) * 100 + ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|			КОНЕЦ
	|	КОНЕЦ КАК ПроцентИзносаПоУчету,
	|	ВЫБОР
	|		КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима
	|					ТОГДА ВТ_ЗимаПоНормамВыдачи.НачалоЗимы
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК НачалоЗимы,
	|	ВЫБОР
	|		КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима
	|					ТОГДА ВТ_ЗимаПоНормамВыдачи.КонецЗимы
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК КонецЗимы
	|ИЗ
	|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК ВыдачаПоПотребностиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И Сотрудник = &Сотрудник) КАК ВыданныеСредстваЗащитыОстатки
	|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ВыданныеСредстваЗащитыОстатки.НормаВыдачи
	|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВыданныеСредстваЗащитыОстатки.НоменклатураНормы
	|			И ВыдачаПоПотребностиОстатки.ДатаВыдачи = ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнийПриходВыдачиПоПотребности КАК ВТ_ПоследнийПриходВыдачиПоПотребности
	|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.НормаВыдачи
	|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВТ_ПоследнийПриходВыдачиПоПотребности.НоменклатураНормы
	|			И ВыдачаПоПотребностиОстатки.ДатаПотребности = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаПотребности
	|			И ВыдачаПоПотребностиОстатки.ДатаВыдачи = ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаВыдачи
	|			И ВыдачаПоПотребностиОстатки.ПроцентИзноса = ВТ_ПоследнийПриходВыдачиПоПотребности.ПроцентИзноса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗимаПоНормамВыдачи КАК ВТ_ЗимаПоНормамВыдачи
	|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ВТ_ЗимаПоНормамВыдачи.НормаВыдачи
	|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВТ_ЗимаПоНормамВыдачи.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И Сотрудник = &Сотрудник) КАК ПотребностьВыдачиСИЗОстатки
	|		ПО ВыдачаПоПотребностиОстатки.НормаВыдачи = ПотребностьВыдачиСИЗОстатки.НормаВыдачи
	|			И ВыдачаПоПотребностиОстатки.НоменклатураНормы = ПотребностьВыдачиСИЗОстатки.НоменклатураНормы
	|			И ВыдачаПоПотребностиОстатки.ДатаПотребности = ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|ГДЕ
	|	НЕ ВыданныеСредстваЗащитыОстатки.Номенклатура ЕСТЬ NULL
	|	И НЕ ПотребностьВыдачиСИЗОстатки.КоличествоОстаток ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаПоПотребностиОстатки.НормаВыдачи,
	|	ВыдачаПоПотребностиОстатки.НоменклатураНормы,
	|	ВыдачаПоПотребностиОстатки.ДатаВыдачи,
	|	ВыдачаПоПотребностиОстатки.ПроцентИзноса,
	|	ВыдачаПоПотребностиОстатки.ДатаПотребности,
	|	ВыдачаПоПотребностиОстатки.КоличествоОстаток,
	|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
	|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА &ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
	|					ТОГДА РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, ДЕНЬ)
	|				ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, МЕСЯЦ)
	|			КОНЕЦ >= 1
	|			ТОГДА 100
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыдачаПоПотребностиОстатки.ПроцентИзноса = 0
	|					ТОГДА ВЫБОР
	|							КОГДА &ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
	|								ТОГДА РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, ДЕНЬ)
	|							ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, МЕСЯЦ)
	|						КОНЕЦ * 100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ДискретностьРасчетаПроцентаИзноса = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
	|							ТОГДА РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, ДЕНЬ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, ДЕНЬ)
	|						ИНАЧЕ РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, &ТекущаяДата, МЕСЯЦ) / РАЗНОСТЬДАТ(ВТ_ПоследнийПриходВыдачиПоПотребности.ДатаДокумента, ВыдачаПоПотребностиОстатки.ДатаПотребности, МЕСЯЦ)
	|					КОНЕЦ * (1 - ВыдачаПоПотребностиОстатки.ПроцентИзноса / 100) * 100 + ВыдачаПоПотребностиОстатки.ПроцентИзноса
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима
	|					ТОГДА ВТ_ЗимаПоНормамВыдачи.НачалоЗимы
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ЗимаПоНормамВыдачи.ЭтоЗима
	|					ТОГДА ВТ_ЗимаПоНормамВыдачи.КонецЗимы
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МесяцыГода.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаЗимы",						ТаблицаЗимы);
	Запрос.УстановитьПараметр("ПодобранныеНормы",					ТаблицаСНормами);
	Запрос.УстановитьПараметр("Период",								ДатаАнализа);
	Запрос.УстановитьПараметр("ТекущаяДата",						?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("Сотрудник",							ТекущийОбъект.Сотрудник);
	Запрос.УстановитьПараметр("Организация",						ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("ДискретностьРасчетаПроцентаИзноса",	ТекущийОбъект.Организация.ДискретностьРасчетаПроцентаИзноса);
	
	ТекущийОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьДокумент(ДанныеЗаполнения,Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			Основание = ДанныеЗаполнения.Сотрудник;
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Основание = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
	Если НЕ Основание.Владелец.ИспользоватьПроцентИзноса Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.Сотрудник 	= Основание;
	Объект.Организация 	= Основание.Владелец;
	
	ЗаполнитьТабличнуюЧасть(Объект);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуАкта(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПродлениеСрокаЭксплуатации_Акт";
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	Документы.Ссылка КАК Ссылка,
	//|	Документы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	//|	Документы.Номер КАК Номер,
	//|	Документы.Дата КАК Дата,
	//|	Документы.Склад.Наименование КАК ПредставлениеСклада,
	//|	Документы.Организация.Префикс КАК Префикс,
	//|	ПРЕДСТАВЛЕНИЕ(Документы.ДокументОснование) КАК ПредставлениеОснования
	//|ИЗ
	//|	Документ.СписаниеНоменклатуры КАК Документы
	//|ГДЕ
	//|	Документы.Ссылка В(&МассивОбъектов)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Товары.Ссылка КАК Ссылка,
	//|	Товары.Количество КАК Количество,
	//|	Товары.Цена КАК Цена,
	//|	Товары.Сумма КАК Сумма,
	//|	ВЫБОР
	//|		КОГДА Товары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//|			ТОГДА Товары.Номенклатура.Наименование
	//|		ИНАЧЕ Товары.Номенклатура.Наименование + "" ("" + Товары.ХарактеристикаНоменклатуры.Наименование + "")""
	//|	КОНЕЦ КАК НаименованиеТовара,
	//|	ВЫБОР
	//|		КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Артикул)
	//|			ТОГДА Товары.Номенклатура.Артикул
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.Код)
	//|					ТОГДА Товары.Номенклатура.Код
	//|				ИНАЧЕ ВЫБОР
	//|						КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.КодСинхронизации)
	//|							ТОГДА Товары.Номенклатура.КодСинхронизации
	//|						ИНАЧЕ ВЫБОР
	//|								КОГДА Товары.Ссылка.Организация.ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ВидДополнительнойИнформацииПоНоменклатуре.НоменклатурныйНомерОрганизации)
	//|									ТОГДА ЕСТЬNULL(НоменклатурныеНомераОрганизаций.НоменклатурныйНомер, """")
	//|								ИНАЧЕ """"
	//|							КОНЕЦ
	//|					КОНЕЦ
	//|			КОНЕЦ
	//|	КОНЕЦ КАК НоменклатурныйНомер,
	//|	Товары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	//|	Товары.НомерСтроки
	//|ИЗ
	//|	Документ.СписаниеНоменклатуры.Товары КАК Товары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурныеНомераОрганизаций КАК НоменклатурныеНомераОрганизаций
	//|		ПО Товары.Ссылка.Организация = НоменклатурныеНомераОрганизаций.Организация
	//|			И Товары.Номенклатура = НоменклатурныеНомераОрганизаций.Номенклатура
	//|			И Товары.ХарактеристикаНоменклатуры = НоменклатурныеНомераОрганизаций.ХарактеристикаНоменклатуры
	//|ГДЕ
	//|	Товары.Ссылка В(&МассивОбъектов)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Ссылка,
	//|	Товары.НомерСтроки
	//|ИТОГИ ПО
	//|	Ссылка");
	//
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеНоменклатуры.ПФ_MXL_СписаниеНоменклатуры");
	//
	//ПакетЗапросов = Запрос.ВыполнитьПакет();
	//ДанныеПечати = ПакетЗапросов[0].Выбрать();
	//ВыборкаПоДокументам = ПакетЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//ПервыйДокумент = Истина;
	//
	//Пока ДанныеПечати.Следующий() Цикл
	//	
	//	Если НЕ ВыборкаПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ДанныеПечати.Ссылка)) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	Если Не ПервыйДокумент Тогда
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ПервыйДокумент = Ложь;
	//		
	//	Область = Макет.ПолучитьОбласть("Шапка");
	//	Область.Параметры.Заполнить(ДанныеПечати);
	//	
	//	Область.Параметры.ТекстЗаголовка = ПроцедурыРаботыСНормамиСервер.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата, Префикс", ДанныеПечати.Номер, ДанныеПечати.Дата, ДанныеПечати.Префикс), "Списание номенклатуры");
	//	ТабличныйДокумент.Вывести(Область);
	//		
	//	СчетСтрок = 1;
	//	ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
	//	Пока ВыборкаПоТоварам.Следующий() Цикл
	//		
	//		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//		Область.Параметры.Заполнить(ВыборкаПоТоварам);
	//		ТабличныйДокумент.Вывести(Область);
	//		
	//		СчетСтрок = СчетСтрок + 1;
	//		
	//	КонецЦикла;
	//	
	//	Область = Макет.ПолучитьОбласть("Подвал");
	//	ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
	//	ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
	//	Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
	//	ТабличныйДокумент.Вывести(Область);
	//	
	//	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	//	
	//КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//акт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПродлениеСрокаЭксплуатации";
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

#КонецЕсли
